evil_hangman_app-master/app/views/static_pages/stats.html.erb

<% hard=[] %>
<% size = Game.count %>
---
SELECT COUNT(*) FROM "games"

<% size.times do |i| %>
  <% diff = Game.find(i+1).difficulty %>
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 0]]