evil_hangman_app-master/app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)
    @user = current_user
    @game.name = @user.name
    @game.words = "0"
    @game.deaths = "0"
    @game.correct_guesses = "0"
    @game.wrong_guesses = "0"
    if @game.save
---
INSERT INTO "games" ("difficulty", "name", "words", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["difficulty", "Medium"], ["name", "Greg"], ["words", "0"], ["created_at", "2017-04-24 02:30:16.638040"], ["updated_at", "2017-04-24 02:30:16.638040"]]

  def show
    @id = params[:id]
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 9]]

  def updateStats
    update_hash = params[:update]
    id = update_hash["id"]
    @game = Game.find(id)

    @game.deaths = update_hash["deaths"]
    @game.words = update_hash["solved"]
    @game.correct_guesses = update_hash["correct"]
    @game.wrong_guesses = update_hash["wrong"]
    @game.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "games" SET "words" = ?, "correct_guesses" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["words", "1"], ["correct_guesses", "5"], ["updated_at", "2017-04-25 07:58:23.306506"], ["id", 5]]

  def random
    random_hash = params[:difficulty]
    id = random_hash["id"]
    @game = Game.find(id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 0]]

  def updateLetter

    guessed_letters = []
    game_over = false
    guesses_left = 15
    word_pattern ="--------"
    puts word_pattern
    length_of_word=8
    words=[]


    #get guessed letter from view and add to array
    guess_hash = params[:guessed_letter]
    puts guess_hash

    guessed_letter = guess_hash["letter"].downcase
    guessed_letters.push(guessed_letter)
    guesses_left=guesses_left-1

    word_pattern = guess_hash["word"]
    count = guess_hash["count"]

    length_of_word=word_pattern.length

    id = guess_hash["id"]
    id = id.to_i
    @game = Game.find(id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", nil]]

    data=word_pattern
    puts word_pattern

    @game.save
---
UPDATE "games" SET "words_group" = ?, "updated_at" = ? WHERE "games"."id" = ?